Catalogs/бит_ШаблоныЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныЗагрузки</Name>
			<Comment>Шаблоны загрузки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПоляЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерПозиции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеОплатыКУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ШаблоныЗагрузки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем обязательные поля.
//	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
//		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда // Новый, не копирование.
        если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "ДатаОплаты" )).Количество() = 0 тогда
		 НовСтрока = Объект.ПоляЗагрузки.Добавить();
		 НовСтрока.НомерПозиции = 10;
		 НовСтрока.ПолеОплатыКУ = "ДатаОплаты";
	    конецесли;
		
		если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "ЛицевойСчет" )).Количество() = 0 тогда
		 НовСтрока = Объект.ПоляЗагрузки.Добавить();
		 НовСтрока.НомерПозиции = 3;
		 НовСтрока.ПолеОплатыКУ = "ЛицевойСчет";
	    конецесли; 
		
		если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "Сумма" )).Количество() = 0 тогда
		 НовСтрока = Объект.ПоляЗагрузки.Добавить();
		 НовСтрока.НомерПозиции = 4;
		 НовСтрока.ПолеОплатыКУ = "Сумма";
		конецесли; 
		
		если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "Счетчик" )).Количество() = 0 тогда
		 НовСтрока = Объект.ПоляЗагрузки.Добавить();
		 НовСтрока.НомерПозиции = 13;
		 НовСтрока.ПолеОплатыКУ = "Счетчик";
		конецесли; 
		
		если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "ЗначениеСчетчика" )).Количество() = 0 тогда
		 НовСтрока = Объект.ПоляЗагрузки.Добавить();
		 НовСтрока.НомерПозиции = 14;
		 НовСтрока.ПолеОплатыКУ = "ЗначениеСчетчика";
    	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Проверка обязательных полей.
	ТекстСообщения = "";
	Если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "ДатаОплаты")).Количество() = 0 Тогда
		Отказ = Истина;	
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Отсутствует обязательное поле Оплаты КУ ""Дата Оплаты"". '");
	КонецЕсли;;
	
	Если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "ЛицевойСчет")).Количество() = 0 Тогда
		Отказ = Истина;	
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Отсутствует обязательное поле Оплаты КУ ""Лицевой счет"". '");
	КонецЕсли;;
	//
	//Если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "Сумма")).Количество() = 0 Тогда
	//	Отказ = Истина;	
	//	ТекстСообщения = ТекстСообщения + НСтр("ru = 'Отсутствует обязательное поле Оплаты КУ ""Сумма"".'");
	//КонецЕсли;;
	
	//13.05.2019
	//Если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "Счетчик")).Количество() = 0 Тогда
	//	Отказ = Истина;	
	//	ТекстСообщения = ТекстСообщения + НСтр("ru = 'Отсутствует обязательное поле Оплаты КУ ""Счетчик"".'");
	//КонецЕсли;;
	// БИТ ЖКХ 25.03.2021
    если Объект.ИмяПредопределенныхДанных <> "ШаблонДБФ" тогда
	 Если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", "ЗначениеСчетчика")).Количество() = 0 Тогда
		Отказ = Истина;	
		ТекстСообщения = ТекстСообщения + НСтр("ru = 'Отсутствует обязательное поле Оплаты КУ ""ЗначениеСчетчика"".'");
	 КонецЕсли;;
	конецесли;

	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПоляЗагрузкиНомерПозицииПриИзменении(Элемент)

	// Проверка повторного выбора.
	НомерПозиции =  Элементы.ПоляЗагрузки.ТекущиеДанные.НомерПозиции;
	Если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("НомерПозиции", НомерПозиции)).Количество() > 1 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выбранный номер позиции ""%1"" уже настроен для другого поля!'"),
																				НомерПозиции);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Элементы.ПоляЗагрузки.ТекущиеДанные.НомерПозиции = 0;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоляЗагрузкиПолеОплатыКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Проверка повторного выбора.
	Если Объект.ПоляЗагрузки.НайтиСтроки(Новый Структура("ПолеОплатыКУ", ВыбранноеЗначение)).Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выбранное значение ""%1"" уже используется!'"),
																				ВыбранноеЗначение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
